//------------------------------------------------------------------------------
// encryptionReplace_In.cpp - содержит процедуру ввода параметров
// для уже созданного текста
//------------------------------------------------------------------------------

#include "encryptionReplace.h"

//------------------------------------------------------------------------------
// Ввод параметров текста из файла
void In(encryptionReplace &r, ifstream &ifst) {
    ifst >> r.text >> r.symbols;
}

//------------------------------------------------------------------------------
// Вывод параметров текста в форматируемый поток
void Out(encryptionReplace &r, ofstream &ofst) {
    for (int i = 0; i < r.text.length(); ++i) {
        std::replace( r.text.begin(), r.text.end(), r.text[i], r.symbols[i]); // replace all 'x' to 'y'
    }
    ofst << "Text: text = " << r.text << ", numbers = " << r.symbols;
}

//------------------------------------------------------------------------------
