//------------------------------------------------------------------------------
// encryptionNumbers_In.cpp - содержит процедуру ввода параметров
// для уже созданного текста
//------------------------------------------------------------------------------

#include "encryptionNumbers.h"

//------------------------------------------------------------------------------
// Ввод параметров текста из файла
void In(encryptionNumbers &n, ifstream &ifst) {
    ifst >> n.text >> n.numbers;
}

//------------------------------------------------------------------------------
// Вывод параметров текста в форматируемый поток
void Out(encryptionNumbers &n, ofstream &ofst) {
    for (int i = 0; i < n.text.length(); ++i) {
        std::replace( n.text.begin(), n.text.end(), n.text[i], n.numbers[i]); // replace all 'x' to 'y'
    }
    ofst << "Text: text = " << n.text << ", numbers = " << n.numbers;
}

//------------------------------------------------------------------------------
